Autodesk.Revit.DB.CompoundStructureLayer.DeckProfileId
The ElementId of the structural deck profile - only for a layer whose function is StructuralDeck.
The default is InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.CompoundStructureLayer.MaterialId
Id of the material assigned to this layer.
The default is InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.CompoundStructureLayer.#ctor(System.Double,Autodesk.Revit.DB.MaterialFunctionAssignment,Autodesk.Revit.DB.ElementId)
Creates a default compound structure layer based on the given width, function and material element id.
width:
The width of the layer.
function:
The function of the layer.
materialId:
The material element id of the layer.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructureLayer.#ctor(Autodesk.Revit.DB.CompoundStructureLayer)
Creates a copy of a compound structure layer.
cs:
The compound structure to copy.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null